#### AreaScheme Property

---

|  |
| --- |
| ViewPlan Class   See Also |

The area scheme.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public AreaScheme AreaScheme { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property AreaScheme As AreaScheme 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property AreaScheme^ AreaScheme { 	AreaScheme^ get (); } ``` |

#### Field Value

Returns    a null reference (  Nothing  in Visual Basic)  if this plan view is not an area plan.

# See Also

ViewPlan Class

Autodesk.Revit.DB Namespace